## Varioud types of databases:

    - MySQL
    - MariaDB
    - BigQuery
    - MongoDB
    - Cassandra
    - Redis
    - SqlLIte -> light weight

    Our backend DB is in Cassandra

## Whis IDE you have used for SQL ? 

- DataGrip -> paid
- DBeaver -> free

IDE -> integrated development environment

In [ ]:
# !pip install pysqlite3

In [1]:
# load external module
%load_ext sql

In [2]:
# connection string, 
# how to connect with your DB using some connection parameter. 
%sql sqlite://

# data preparation

In [3]:
%%sql
CREATE TABLE sales
(
    sale_k       varchar(20) primary key,
    ts        timestamp,
    product   integer,
    completed boolean,
    price     float
);
INSERT INTO sales
VALUES ('sale_1', '2019-11-08 00:00', 0, TRUE, 1.1),
       ('sale_2', '2019-11-08 01:00', 0, FALSE, 1.2),
       ('sale_3', '2019-11-08 01:00', 0, TRUE, 1.3),
       ('sale_4', '2019-11-08 01:00', 1, FALSE, 1.4),
       ('sale_5', '2019-11-08 02:00', 1, TRUE, 1.5),
        ('sale_6', '2019-11-08 02:00', 1, TRUE, 1.5),
       ('sale_7', '2019-11-09 02:00', 1, TRUE, 1.1);

 * sqlite://
Done.
7 rows affected.

[]

# data extraction

In [5]:
# * -> all detail/entries
# ; -> semicolon

In [8]:
%%sql
select * from sales;

 * sqlite://
Done.

[('sale_1', '2019-11-08 00:00', 0, 1, 1.1),
 ('sale_2', '2019-11-08 01:00', 0, 0, 1.2),
 ('sale_3', '2019-11-08 01:00', 0, 1, 1.3),
 ('sale_4', '2019-11-08 01:00', 1, 0, 1.4),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5),
 ('sale_7', '2019-11-09 02:00', 1, 1, 1.1),
 ('sale_8', '2019-13-09 05:00', 2, 1, 1.3)]

In [27]:
%%sql
select 
    product,
    sum(price),
    count(price),
    avg(price)
    from sales
    where completed = 1
;

 * sqlite://
Done.

[(0, 7.8, 6, 1.3)]

In [20]:
# give me sum, count and average of all products

In [25]:
%%sql
select 
    product, 
    sum(price) as sum_of_price, 
    count(price) as count_of_price,
    avg(price) as avg_of_price
    from sales
    group by product;

 * sqlite://
Done.

[(0, 3.5999999999999996, 3, 1.2), (1, 5.5, 4, 1.375), (2, 1.3, 1, 1.3)]

In [24]:
%%sql
select 
    product, 
    sum(price), 
    count(price),
    avg(price)
    from sales

 * sqlite://
Done.

[(0, 10.4, 8, 1.3)]

In [ ]:
# group by must always have aggregation function. 
- sum()
- count()

In [15]:
%%sql
select 
    product, avg(price)
    from sales
    group by product;

 * sqlite://
Done.

[(0, 1.2), (1, 1.375), (2, 1.3)]

In [7]:
%%sql
INSERT INTO sales
VALUES ('sale_8', '2019-13-09 05:00', 2, TRUE, 1.3);

 * sqlite://
1 rows affected.

[]

In [10]:
%%sql
select 
    product, price 
    from sales
    where ts >= "2019-11-08 00:00"

 * sqlite://
Done.

[(0, 1.1),
 (0, 1.2),
 (0, 1.3),
 (1, 1.4),
 (1, 1.5),
 (1, 1.5),
 (1, 1.1),
 (2, 1.3)]

In [ ]:
# I want key, product, completed status of sales where 
# time is > 1:00 and price is less than 1.3

# "avinash" > "sharu"
# 50 > 20

In [5]:
%%sql

select key, product, completed from sales where ts > "2019-11-08 01:00" and price < 1.3;

 * sqlite://
Done.

[('sale_7', 1, 1)]

In [22]:
%%sql

select * from sales where ts > "2019-11-08 01:00";

 * sqlite://
Done.

[('sale_5', '2019-11-08 02:00', 1, 1, 1.5),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5)]

In [9]:
%%sql
select * from sales where price > 1.4;

 * sqlite://
Done.

[('sale_5', '2019-11-08 02:00', 1, 1, 1.5),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5)]

In [7]:
%%sql
select ts from sales;

 * sqlite://
Done.

[('2019-11-08 00:00',),
 ('2019-11-08 01:00',),
 ('2019-11-08 01:00',),
 ('2019-11-08 01:00',),
 ('2019-11-08 02:00',),
 ('2019-11-08 02:00',)]

In [8]:
%%sql
select * from sales where product = 1;

 * sqlite://
Done.

[('sale_4', '2019-11-08 01:00', 1, 0, 1.4),
 ('sale_5', '2019-11-08 02:00', 1, 1, 1.5),
 ('sale_6', '2019-11-08 02:00', 1, 1, 1.5)]

In [6]:
%%sql
select ts, product from sales where price > 1.4;

 * sqlite://
Done.

[('2019-11-08 02:00', 1), ('2019-11-08 02:00', 1)]

In [15]:
%%sql 
SELECT name FROM sqlite_master WHERE type='table'

 * sqlite://
Done.

[('sales',)]

https://www.w3schools.com/sql/sql_select.asp
https://www.w3schools.com/sql/trysql.asp?filename=trysql_select_where

In [1]:
![]("../../1627651746552.jpeg")

/bin/bash: -c: line 0: syntax error near unexpected token `"../../1627651746552.jpeg"'
/bin/bash: -c: line 0: `[]("../../1627651746552.jpeg")'

select name
 from table_name
 where condition
 group by <gouping of things>
 having <condition on group by >
    order by
    Limit